In [1]:
import pandas as pd

C:\Users\user\AppData\Local\Temp\ipykernel_3636\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'bangalore'],
    'temprature': [32, 45, 30],
    'humidity': [80, 60, 78]
})

In [3]:
india_weather

        city  temprature  humidity
0     mumbai          32        80
1      delhi          45        60
2  bangalore          30        78

In [4]:
us_weather = pd.DataFrame({
    'city': ['new york', 'chicago', 'orlando'],
    'temprature': [21, 14, 35],
    'humidity': [68, 65, 75]
})

In [5]:
us_weather

       city  temprature  humidity
0  new york          21        68
1   chicago          14        65
2   orlando          35        75

In [6]:
#code to concatinate two or more dataframes.
df = pd.concat([india_weather, us_weather])

In [7]:
df

        city  temprature  humidity
0     mumbai          32        80
1      delhi          45        60
2  bangalore          30        78
0   new york          21        68
1    chicago          14        65
2    orlando          35        75

In [8]:
df.reset_index()

   index       city  temprature  humidity
0      0     mumbai          32        80
1      1      delhi          45        60
2      2  bangalore          30        78
3      0   new york          21        68
4      1    chicago          14        65
5      2    orlando          35        75

In [9]:
df

        city  temprature  humidity
0     mumbai          32        80
1      delhi          45        60
2  bangalore          30        78
0   new york          21        68
1    chicago          14        65
2    orlando          35        75

In [10]:
# code to ignore the index number
df = pd.concat([india_weather, us_weather], ignore_index=True)

In [11]:
df

        city  temprature  humidity
0     mumbai          32        80
1      delhi          45        60
2  bangalore          30        78
3   new york          21        68
4    chicago          14        65
5    orlando          35        75

In [13]:
# code to concatinate multiple dataframe as per keys.
df = pd.concat([india_weather, us_weather], keys=['india', 'us'])

In [14]:
df

              city  temprature  humidity
india 0     mumbai          32        80
      1      delhi          45        60
      2  bangalore          30        78
us    0   new york          21        68
      1    chicago          14        65
      2    orlando          35        75

In [15]:
df.loc['india']

        city  temprature  humidity
0     mumbai          32        80
1      delhi          45        60
2  bangalore          30        78

In [16]:
df.loc['india'].loc[1]

city          delhi
temprature       45
humidity         60
Name: 1, dtype: object

In [17]:
df.loc['us']

       city  temprature  humidity
0  new york          21        68
1   chicago          14        65
2   orlando          35        75

In [18]:
temprature_df = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'bangalore'],
    'temprature': [32, 45, 30]
})

In [19]:
temprature_df

        city  temprature
0     mumbai          32
1      delhi          45
2  bangalore          30

In [20]:
windspeed_df = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'bangalore'],
    'windspeed': [7, 12, 9]
})

In [21]:
windspeed_df

        city  windspeed
0     mumbai          7
1      delhi         12
2  bangalore          9

In [22]:
#after doing concatinate
df = pd.concat([temprature_df, windspeed_df])

In [23]:
df

        city  temprature  windspeed
0     mumbai        32.0        NaN
1      delhi        45.0        NaN
2  bangalore        30.0        NaN
0     mumbai         NaN        7.0
1      delhi         NaN       12.0
2  bangalore         NaN        9.0

In [24]:
#code to concatinate second data as column not in the rows.
df = pd.concat([temprature_df, windspeed_df], axis=1)

In [25]:
df

        city  temprature       city  windspeed
0     mumbai          32     mumbai          7
1      delhi          45      delhi         12
2  bangalore          30  bangalore          9

In [26]:
#suppose data in both the dataframe are not uniform.
temprature_df = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'bangalore'],
    'temprature': [32, 45, 30]
})

In [27]:
windspeed_df = pd.DataFrame({
    'city': ['delhi', 'mumbai'],
    'windspeed': [7, 12]
})

In [28]:
df = pd.concat([temprature_df, windspeed_df], axis=1)

In [30]:
# correct data will not come.
df

        city  temprature    city  windspeed
0     mumbai          32   delhi        7.0
1      delhi          45  mumbai       12.0
2  bangalore          30     NaN        NaN

In [32]:
# to correct the above issues we can assign correct index order to each dataframe then we can apply concat function.
temprature_df = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'bangalore'],
    'temprature': [32, 45, 30]
}, index=[0, 1, 2])

In [33]:
temprature_df

        city  temprature
0     mumbai          32
1      delhi          45
2  bangalore          30

In [34]:
windspeed_df = pd.DataFrame({
    'city': ['delhi', 'mumbai'],
    'windspeed': [7, 12]
}, index=[1, 0])

In [35]:
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [36]:
df = pd.concat([temprature_df, windspeed_df], axis=1)

In [37]:
df

        city  temprature    city  windspeed
0     mumbai          32  mumbai       12.0
1      delhi          45   delhi        7.0
2  bangalore          30     NaN        NaN

In [39]:
# code to create a series in the pandas.
s = pd.Series(['Humid', 'Dry', 'Rain'], name='event')

In [40]:
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [41]:
# code to append the event column in to the dataframe
df = pd.concat([temprature_df, s], axis=1)

In [42]:
df

        city  temprature  event
0     mumbai          32  Humid
1      delhi          45    Dry
2  bangalore          30   Rain